# SetTextStyleRef

## Description
Procedure SetTextStyleRef sets the text style of an object to the referenced style. Reference 0 means Un-Styled.  This procedure will replace by-class styling.

```pascal
PROCEDURE SetTextStyleRef(
				objectId     : HANDLE;
				textStyleRef : LONGINT);
```

```python

def vs.SetTextStyleRef(objectId, textStyleRef):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|objectId|HANDLE|handle to object|
|textStyleRef|LONGINT|text style reference id|

## See Also
VS Functions:
SetTextStyleRef| GetTextStyleRef| SetTextStyleRefN| GetTextStyleRefN| SetTextStyleByClass| SetTextStyleByClassN| IsTextStyleByClass| IsTextStyleByClassN

## Version
Availability: from Vectorworks 2015
## Category
* Objects - Text